In [1]:
import pandas as pd

In [2]:
s = pd.Series([3, -5, 7, 4],  index=['a',  'b',  'c',  'd'])

In [3]:
print(s)

a    3
b   -5
c    7
d    4
dtype: int64

In [4]:
dist = {
    "name ":['Ahmed','Wajhat','Muneeb','Hafeez','Tashi'],
    "marks":[90,98,89,99,87],
    "city":['lahore','islambad','changa_manga' , 'xyz','abc']
}

In [5]:
print(dist)

{'name ': ['Ahmed', 'Wajhat', 'Muneeb', 'Hafeez', 'Tashi'], 'marks': [90, 98, 89, 99, 87], 'city': ['lahore', 'islambad', 'changa_manga', 'xyz', 'abc']}

In [6]:
df = pd.DataFrame(dist)

In [7]:
print(df)

    name   marks          city
0   Ahmed     90        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga
3  Hafeez     99           xyz
4   Tashi     87           abc

In [8]:
df.to_csv('abc.csv')

In [9]:
df.to_csv('abc.csv' , index = False)

In [10]:
df.head(2)

    name   marks      city
0   Ahmed     90    lahore
1  Wajhat     98  islambad

In [11]:
df.describe()

           marks
count   5.000000
mean   92.600000
std     5.504544
min    87.000000
25%    89.000000
50%    90.000000
75%    98.000000
max    99.000000

In [12]:
a = pd.read_csv('t5.8k.csv')

In [13]:
print(a)

      121.561996   81.001999
0     762.096985   70.461998
1     127.569000  113.457001
2      95.467003  116.822998
3     652.234009   60.743000
4     324.015991   91.058998
...          ...         ...
7994  728.572998   40.826000
7995  452.121002   52.111000
7996  485.912994   63.375999
7997  241.496994  121.903000
7998  532.468018   16.757999

[7999 rows x 2 columns]

In [14]:
a

      121.561996   81.001999
0     762.096985   70.461998
1     127.569000  113.457001
2      95.467003  116.822998
3     652.234009   60.743000
4     324.015991   91.058998
...          ...         ...
7994  728.572998   40.826000
7995  452.121002   52.111000
7996  485.912994   63.375999
7997  241.496994  121.903000
7998  532.468018   16.757999

[7999 rows x 2 columns]

In [15]:
abc = pd.read_csv('abc.csv')

In [16]:
abc

    name   marks          city
0   Ahmed     90        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga
3  Hafeez     99           xyz
4   Tashi     87           abc

In [17]:
abc['marks'][0]

90

In [18]:
abc['marks'][0] = 92

C:\Users\Ahmed\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [19]:
df.to_csv('abc.csv' , index = False)

In [20]:
abc

    name   marks          city
0   Ahmed     92        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga
3  Hafeez     99           xyz
4   Tashi     87           abc

In [21]:
import numpy as np

In [22]:
ser =pd.Series(np.random.rand(10))

In [23]:
ser

0    0.251374
1    0.636556
2    0.604496
3    0.538451
4    0.138451
5    0.267386
6    0.055794
7    0.694305
8    0.415417
9    0.774016
dtype: float64

In [24]:
type(ser)

pandas.core.series.Series

In [25]:
newdf = pd.DataFrame(np.random.rand(334,5) , index = np.arange(334))

In [26]:
newdf

            0         1         2         3         4
0    0.255771  0.733627  0.747426  0.769398  0.857065
1    0.912220  0.751922  0.685961  0.097533  0.053060
2    0.657844  0.177010  0.616179  0.735595  0.042513
3    0.128966  0.081192  0.758853  0.371996  0.557527
4    0.769250  0.830238  0.158782  0.115210  0.343459
..        ...       ...       ...       ...       ...
329  0.027302  0.836817  0.683371  0.047481  0.662642
330  0.501279  0.152491  0.462619  0.771087  0.722686
331  0.650348  0.492025  0.849070  0.290893  0.740891
332  0.386096  0.174715  0.964613  0.780267  0.900289
333  0.102792  0.599816  0.537066  0.489475  0.276077

[334 rows x 5 columns]

In [31]:
df = pd.read_csv('abc.csv')

In [33]:
df

    name   marks          city
0   Ahmed     90        lahore
1  Wajhat     98      islambad
2  Muneeb     89  changa_manga
3  Hafeez     99           xyz
4   Tashi     87           abc

In [35]:
df['marks'].max()

99

In [39]:
df['marks'][df['city']=='lahore']

0    90
Name: marks, dtype: int64

In [41]:
df['marks'].mean()

92.6

In [44]:
df.fillna(0 , inplace = True)  ##use for removing Nan (due to empty spaces in data)